OdIfcFile.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the file object to a physical file.
\param filename     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdIfcFile.readFile(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified IFC file.
\param fileName [in] A smart pointer to the data buffer associated with the input IFC file.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error code.